This notebook explores the yellow_taxi dataset and also
loads the green_taxi dataset and answers the assignment questions

In [1]:
import pandas as pd

In [46]:
from sqlalchemy import create_engine
import psycopg2
import pyodbc
import time

In [5]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [6]:
engine.connect()

In [7]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

In [8]:
pd.read_sql(query, con=engine)

Empty DataFrame
Columns: [schemaname, tablename, tableowner, tablespace, hasindexes, hasrules, hastriggers, rowsecurity]
Index: []

In [11]:
df = pd.read_csv('../data/yellow_tripdata_2021-01.csv.gz', compression="gzip", nrows=100)

In [12]:
df.shape

(100, 18)

In [13]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1,2.10,1,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1,0.20,1,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1,14.70,1,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0,10.60,1,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1,4.94,1,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5

In [14]:
df.dtypes

VendorID                   int64
tpep_pickup_datetime      object
tpep_dropoff_datetime     object
passenger_count            int64
trip_distance            float64
RatecodeID                 int64
store_and_fwd_flag        object
PULocationID               int64
DOLocationID               int64
payment_type               int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
congestion_surcharge     float64
dtype: object

In [15]:
# change the datatype for date fields
df.tpep_pickup_datetime = pd.to_datetime(df.tpep_pickup_datetime)
df.tpep_dropoff_datetime = pd.to_datetime(df.tpep_dropoff_datetime)

In [16]:
df.to_sql(name='yellow_tripdata_trip_top100', con=engine, index=False)

100

In [41]:
print(pd.io.sql.get_schema(df, name='yellow_taxi_data', con=engine))

CREATE TABLE yellow_taxi_data (
	"VendorID" BIGINT,
	tpep_pickup_datetime TIMESTAMP WITHOUT TIME ZONE,
	tpep_dropoff_datetime TIMESTAMP WITHOUT TIME ZONE,
	passenger_count BIGINT,
	trip_distance FLOAT(53),
	"RatecodeID" BIGINT,
	store_and_fwd_flag TEXT,
	"PULocationID" BIGINT,
	"DOLocationID" BIGINT,
	payment_type BIGINT,
	fare_amount FLOAT(53),
	extra FLOAT(53),
	mta_tax FLOAT(53),
	tip_amount FLOAT(53),
	tolls_amount FLOAT(53),
	improvement_surcharge FLOAT(53),
	total_amount FLOAT(53),
	congestion_surcharge FLOAT(53)
)

In [19]:
query = """
SELECT * FROM yellow_tripdata_trip_top100 LIMIT 10
"""

In [20]:
pd.read_sql(query, con=engine)

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,1,2021-01-01 00:30:10,2021-01-01 00:36:12,1,2.10,1,N,142,43,2,8.0,3.0,0.5,0.00,0.0,0.3,11.80,2.5
1,1,2021-01-01 00:51:20,2021-01-01 00:52:19,1,0.20,1,N,238,151,2,3.0,0.5,0.5,0.00,0.0,0.3,4.30,0.0
2,1,2021-01-01 00:43:30,2021-01-01 01:11:06,1,14.70,1,N,132,165,1,42.0,0.5,0.5,8.65,0.0,0.3,51.95,0.0
3,1,2021-01-01 00:15:48,2021-01-01 00:31:01,0,10.60,1,N,138,132,1,29.0,0.5,0.5,6.05,0.0,0.3,36.35,0.0
4,2,2021-01-01 00:31:49,2021-01-01 00:48:21,1,4.94,1,N,68,33,1,16.5,0.5,0.5,4.06,0.0,0.3,24.36,2.5
5,1,2021-01-01 00:16:29,2021-01-01 00:24:30,1,1.60,1,N,224,68,1,8.0,3.0,0.5,2.35,0.0,0.3,14.15,2.5
6,1,2021-01-01 00:00:28,2021-01-01 00:17:28,1,4.10,1,N,95,157,2,16.0,0.5,0.5,0.00,0.0,0.3,17.30,0.0
7,1,2021-01-01 00:12:29,2021-01-01 00:30:34,1,5.70,1,N,90,40,2,18.0,3.0,0.5,0.00,0.0,0.3,21.80,2.5
8,1,2021-01-01 00:39:16,2021-01-01 01:00:13,1,9.10,1,N,97,129,4,27.5,0.5,0.5,0.00,0.0,0.3,28.80,0.0
9,1,2021-01-01 00:26:12,2021-01-01 00:39:46,2,2.70,1,N,263,142,1,12.0,3.0,0.5,3.15,0.0,0.3,18.95,2.5

In [25]:
conn = psycopg2.connect(
   database="ny_taxi", user='root', password='root', host='localhost', port= '5432'
)

In [26]:
cursor = conn.cursor()

In [22]:
query = """
DROP TABLE yellow_tripdata_trip_top100
"""

In [27]:
cursor.execute(query)

In [28]:
conn.commit()

In [40]:
try:
    pd.read_sql(query, con=engine)
except (pyodbc.ProgrammingError):
    print("Table doesn't exist")

ProgrammingError: (psycopg2.errors.UndefinedTable) table "yellow_tripdata_trip_top100" does not exist

[SQL:
DROP TABLE yellow_tripdata_trip_top100
]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [33]:
conn.close()

## Load Taxi data

In [44]:
df_iter = pd.read_csv('../data/yellow_tripdata_2021-01.csv.gz', compression="gzip", 
                      iterator=True, chunksize=100000)

In [45]:
type(df_iter)

pandas.io.parsers.readers.TextFileReader

In [47]:
# insert the header
df.head(n=0).to_sql(name='yellow_taxi_data', 
                               con=engine, if_exists='replace', low_memory=False)

0

In [48]:
for batch in df_iter:
    t_start = time.time()
    batch.tpep_pickup_datetime = pd.to_datetime(batch.tpep_pickup_datetime)
    batch.tpep_dropoff_datetime = pd.to_datetime(batch.tpep_dropoff_datetime)
    batch.to_sql(name='yellow_taxi_data', con=engine, if_exists='append')

    t_end = time.time()
    print('Inserted another chunk, took %.3f second' % (t_end - t_start))

Inserted another chunk, took 10.584 second
Inserted another chunk, took 10.141 second
Inserted another chunk, took 11.032 second
Inserted another chunk, took 11.665 second
Inserted another chunk, took 9.735 second
Inserted another chunk, took 10.312 second
Inserted another chunk, took 9.971 second
Inserted another chunk, took 10.120 second
Inserted another chunk, took 10.353 second
Inserted another chunk, took 10.499 second
Inserted another chunk, took 10.908 second

/var/folders/tb/tknsg8m10jvc1t4fztzvf7kh0000gn/T/ipykernel_5267/3166953319.py:1: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  for batch in df_iter:

Inserted another chunk, took 11.798 second
Inserted another chunk, took 7.426 second

In [49]:
query = """
SELECT * FROM yellow_taxi_data LIMIT 10
"""

In [50]:
pd.read_sql(query, con=engine)

,index,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge
0,100000,2,2021-01-04 14:42:51,2021-01-04 14:51:18,1,1.43,1,N,170,161,2,7.5,0.0,0.5,0.00,0.0,0.3,10.80,2.5
1,100001,2,2021-01-04 14:04:39,2021-01-04 14:18:41,1,2.82,1,N,170,143,2,12.0,0.0,0.5,0.00,0.0,0.3,15.30,2.5
2,100002,1,2021-01-04 14:12:49,2021-01-04 14:31:21,0,2.70,1,N,68,239,1,13.5,2.5,0.5,3.35,0.0,0.3,20.15,2.5
3,100003,1,2021-01-04 14:43:55,2021-01-04 14:48:45,1,0.70,1,N,246,68,2,5.5,2.5,0.5,0.00,0.0,0.3,8.80,2.5
4,100004,1,2021-01-04 14:59:16,2021-01-04 15:07:08,1,1.60,1,N,161,234,1,8.0,2.5,0.5,2.25,0.0,0.3,13.55,2.5
5,100005,2,2021-01-04 14:19:25,2021-01-04 14:27:25,1,2.04,1,N,48,234,1,8.5,0.0,0.5,2.36,0.0,0.3,14.16,2.5
6,100006,1,2021-01-04 14:05:13,2021-01-04 14:09:53,1,0.90,1,N,161,229,1,5.5,2.5,0.5,1.75,0.0,0.3,10.55,2.5
7,100007,1,2021-01-04 14:13:43,2021-01-04 14:25:17,1,2.40,1,N,233,90,1,10.5,2.5,0.5,2.50,0.0,0.3,16.30,2.5
8,100008,1,2021-01-04 14:39:19,2021-01-04 14:44:26,1,0.80,1,N,113,79,2,5.0,2.5,0.5,0.00,0.0,0.3,8.30,2.5
9,100009,1,2021-01-04 14:49:23,2021-01-04 15:08:45,1,4.30,1,N,79,236,1,16.5,2.5,0.5,2.00,0.0,0.3,21.80,2.5

In [51]:
query = """
SELECT COUNT(*) FROM yellow_taxi_data
"""

In [52]:
pd.read_sql(query, con=engine)

     count
0  1269765

In [54]:
df_zones = pd.read_csv('../data/taxi_zone_lookup.csv')
df_zones.to_sql(name='zones', con=engine, if_exists='replace')

265

## Assignment questions

In [138]:
df = pd.read_csv("../data/green_tripdata_2019-01.csv", nrows=10)

In [139]:
df_iter = pd.read_csv('../data/green_tripdata_2019-01.csv', 
                      iterator=True, chunksize=100000, low_memory=False)

In [61]:
# this will exhaust 100K records which is why my table
# didn't have all the records
next(df_iter)

,VendorID,lpep_pickup_datetime,lpep_dropoff_datetime,store_and_fwd_flag,RatecodeID,PULocationID,DOLocationID,passenger_count,trip_distance,fare_amount,extra,mta_tax,tip_amount,tolls_amount,ehail_fee,improvement_surcharge,total_amount,payment_type,trip_type,congestion_surcharge
200000,2,2019-01-11 07:28:47,2019-01-11 08:01:59,N,1,225,181,1,5.07,23.0,0.0,0.5,0.00,0.00,NaN,0.3,23.80,1,1,NaN
200001,2,2019-01-11 07:44:42,2019-01-11 07:49:27,N,1,25,33,1,0.75,5.5,0.0,0.5,0.00,0.00,NaN,0.3,6.30,2,1,NaN
200002,2,2019-01-11 07:56:03,2019-01-11 08:08:57,N,1,165,123,1,1.89,10.5,0.0,0.5,0.00,0.00,NaN,0.3,11.30,1,1,NaN
200003,2,2019-01-11 07:27:45,2019-01-11 07:35:46,N,1,145,170,1,2.50,9.0,0.0,0.5,3.89,5.76,NaN,0.3,19.45,1,1,NaN
200004,2,2019-01-11 07:04:34,2019-01-11 07:26:22,N,1,217,181,1,5.88,21.0,0.0,0.5,0.00,0.00,NaN,0.3,21.80,1,1,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
299995,2,2019-01-15 22:51:56,2019-01-15 22:59:06,N,1,166,41,1,1.17,7.0,0.5,0.5,0.00,0.00,NaN,0.3,8.30,2,1,NaN
299996,2,2019-01-15 22:47:18,2019-01-15 23:00:05,N,1,66,232,1,3.27,13.0,0.5,0.5,2.86,0.00,NaN,0.3,17.16,1,1,NaN
299997,2,2019-01-15 22:17:02,2019-01-15 22:20:57,N,1,182,182,1,0.81,5.0,0.5,0.5,1.26,0.00,NaN,0.3,7.56,1,1,NaN
299998,2,2019-01-15 22:17:34,2019-01-15 22:20:41,N,1,223,179,4,0.64,4.5,0.5,0.5,1.16,0.00,NaN,0.3,6.96,1,1,NaN
299999,2,2019-01-15 22:27:04,2019-01-15 22:37:26,N,1,7,129,1,2.09,9.5,0.5,0.5,2.16,0.00,NaN,0.3,12.96,1,1,NaN

In [140]:
# insert the header
df.head(n=0).to_sql(name='green_taxi_data', 
                               con=engine, if_exists='replace')

0

In [141]:
for batch in df_iter:
    t_start = time.time()
    batch.lpep_pickup_datetime = pd.to_datetime(batch.lpep_pickup_datetime)
    batch.lpep_dropoff_datetime = pd.to_datetime(batch.lpep_dropoff_datetime)
    batch.to_sql(name='green_taxi_data', con=engine, if_exists='append')

    t_end = time.time()
    print('Inserted another chunk, took %.3f second' % (t_end - t_start))

Inserted another chunk, took 10.042 second
Inserted another chunk, took 9.912 second
Inserted another chunk, took 10.903 second
Inserted another chunk, took 11.390 second
Inserted another chunk, took 10.162 second
Inserted another chunk, took 10.420 second
Inserted another chunk, took 3.337 second

In [142]:
query = """
SELECT COUNT(*) FROM green_taxi_data
"""

In [143]:
pd.read_sql(query, con=engine)

    count
0  630918

In [185]:
query = """
SELECT MIN(lpep_pickup_datetime), MAX(lpep_dropoff_datetime) FROM green_taxi_data
"""

In [186]:
pd.read_sql(query, con=engine)

                   min                  max
0  2009-01-01 00:05:59  2019-02-01 23:10:47

### Q3 Count records

How many taxi trips were totally made on January 15?<br/>
Note - The end of trip should be on the same date

In [187]:
query = """
SELECT
    COUNT(1)
FROM
    green_taxi_data
WHERE
    lpep_pickup_datetime >= '2019-01-15 00:00:00'
AND
   lpep_dropoff_datetime < '2019-01-16 00:00:00'
"""

In [188]:
res = pd.read_sql(query, con=engine)

In [189]:
res

   count
0  20530

### Q4 Largest trip of the day

Which was the day with the largest trip distance?

In [190]:
query = """
SELECT
    lpep_pickup_datetime::date,
    MAX(trip_distance) max_trip_distance
FROM
    green_taxi_data
GROUP BY
    lpep_pickup_datetime::date
ORDER BY
    max_trip_distance DESC
"""

In [191]:
res = pd.read_sql(query, con=engine)

In [194]:
res.head(5)

  lpep_pickup_datetime  max_trip_distance
0           2019-01-15             117.99
1           2019-01-18              80.96
2           2019-01-28              64.27
3           2019-01-10              64.20
4           2019-01-06              60.91

### Q5 The number of passengers

In 2019-01-01 how many trips had 2 and 3 passengers?

In [205]:
query = """
SELECT
    SUM(CASE WHEN passenger_count = 2 THEN 1 END) p2_count,
    SUM(CASE WHEN passenger_count = 3 THEN 1 END) p3_count
FROM
    green_taxi_data
WHERE
    lpep_pickup_datetime::date = '2019-01-01'

"""

In [206]:
res = pd.read_sql(query, con=engine)

In [207]:
res

   p2_count  p3_count
0      1282       254

### Q6 Largest tip

For the passengers picked up in the Astoria Zone which was the drop up zone that had the largest tip?

In [239]:
query = """
WITH pickup AS (
    SELECT
        "PULocationID",
        "DOLocationID",
        "Zone",
        tip_amount
    FROM
        green_taxi_data a JOIN zones b ON a."PULocationID" = b."LocationID"
    WHERE
        "Zone" = 'Astoria'
        
)
,
dropoff AS (
    SELECT 
        "DOLocationID", 
        MAX(tip_amount) max_tip_amount 
    FROM 
        pickup
    GROUP BY
        "DOLocationID"
    ORDER BY
        max_tip_amount desc
    LIMIT 1
)
SELECT 
    "Zone"
FROM
    zones
WHERE "LocationID" IN (
                    SELECT 
                        "DOLocationID"
                    FROM
                        dropoff
                    )
                
"""

In [240]:
res = pd.read_sql(query, con=engine)

In [241]:
res

                            Zone
0  Long Island City/Queens Plaza